Repository: xcv58/MacTools
Catalog: Plugins/InputRemapping/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# widget.title
source: 快捷操作
ar: إجراءات سريعة
de: Schnellaktionen
en: Quick Actions
es: Acciones rápidas
fr: Actions rapides
ja: クイックアクション
ko: 빠른 동작
pt: Ações rápidas
ru: Быстрые действия
tr: Hızlı Eylemler

# action.singleKey
source: 单键
ar: مفتاح واحد
de: Einzeltaste
en: Single Key
es: Tecla única
fr: Touche unique
ja: 単一キー
ko: 단일 키
pt: Tecla única
ru: Одна клавиша
tr: Tek Tuş
zh_hant: 單鍵

# action.singleKey.format
source: 单键 %@
ar: مفتاح واحد %@
de: Einzeltaste %@
en: Single key %@
es: Tecla única %@
fr: Touche unique %@
ja: 単一キー %@
ko: 단일 키 %@
pt: Tecla única %@
ru: Одна клавиша %@
tr: Tek tuş %@
zh_hant: 單鍵 %@

# settings.singleKey.preparing
source: 正在准备按键录制…
ar: جارٍ تحضير تسجيل المفتاح…
de: Tastenaufnahme wird vorbereitet …
en: Preparing key recording…
es: Preparando la grabación de tecla…
fr: Préparation de l’enregistrement…
ja: キー記録を準備中…
ko: 키 기록 준비 중…
pt: A preparar gravação da tecla…
ru: Подготовка записи клавиши…
tr: Tuş kaydı hazırlanıyor…
zh_hant: 正在準備按鍵錄製…

# settings.singleKey.preparing.detail
source: 松开“录制按键”按钮后开始监听。
ar: حرّر زر تسجيل المفتاح؛ سيبدأ الاستماع بعد ذلك.
de: Lass die Taste „Taste aufnehmen“ los; danach beginnt die Aufnahme.
en: Release the Record Key button; listening starts next.
es: Suelta el botón Grabar tecla; la escucha comenzará después.
fr: Relâchez le bouton Enregistrer la touche ; l’écoute commencera ensuite.
ja: 「キーを記録」ボタンを離すと、待機が始まります。
ko: 키 기록 버튼에서 손을 떼면 감지가 시작됩니다.
pt: Solte o botão Gravar tecla; a escuta começa a seguir.
ru: Отпустите кнопку записи — затем начнётся ожидание клавиши.
tr: Tuşu Kaydet düğmesini bırakın; dinleme hemen başlayacak.
zh_hant: 放開「錄製按鍵」按鈕後開始聆聽。

# settings.singleKey.record
source: 录制按键
ar: تسجيل مفتاح
de: Taste aufnehmen
en: Record Key
es: Grabar tecla
fr: Enregistrer la touche
ja: キーを記録
ko: 키 기록
pt: Gravar tecla
ru: Записать клавишу
tr: Tuşu Kaydet
zh_hant: 錄製按鍵

# settings.singleKey.recording
source: 按下一个按键
ar: اضغط مفتاحًا واحدًا
de: Eine Taste drücken
en: Press one key
es: Pulsa una tecla
fr: Appuyez sur une touche
ja: キーを1つ押す
ko: 키 하나 누르기
pt: Prima uma tecla
ru: Нажмите одну клавишу
tr: Bir tuşa basın
zh_hant: 按下一個按鍵

# action.mediaPlayPause
source: 播放/暂停
ar: تشغيل/إيقاف مؤقت
de: Wiedergabe/Pause
en: Play/Pause
es: Reproducir/Pausar
fr: Lecture/Pause
ja: 再生/一時停止
ko: 재생/일시 정지
pt: Reproduzir/Pausar
ru: Воспроизведение/Пауза
tr: Oynat/Duraklat
zh_hant: 播放/暫停

# action.missionControl
source: 调度中心
ar: إدارة المهام
de: Missionskontrolle
en: Mission Control
es: Control de misión
fr: Contrôle de mission
ja: ミッションコントロール
ko: 미션 컨트롤
pt: Controle da Missão
ru: Управление миссией
tr: Mission Control
zh_hant: 任務控制中心

# action.mouseBack
source: 鼠标后退
ar: زر الرجوع في الماوس
de: Maus zurück
en: Mouse Back
es: Ratón atrás
fr: Retour de la souris
ja: マウスバック
ko: 마우스 뒤로
pt: Rato de volta
ru: Мышь Назад
tr: Fare Geri
zh_hant: 滑鼠返回

# action.mouseForward
source: 鼠标前进
ar: زر التقدم في الماوس
de: Maus vorwärts
en: Mouse Forward
es: Ratón hacia adelante
fr: Souris en avant
ja: マウスフォワード
ko: 마우스 앞으로
pt: Mouse para frente
ru: Мышь вперед
tr: Fare İleri
zh_hant: 滑鼠向前

# action.mouseMiddle
source: 中键点击
ar: النقر بالزر الأوسط
de: Mittlerer Klick
en: Middle Click
es: Clic medio
fr: Clic du milieu
ja: 中クリック
ko: 가운데 클릭
pt: Clique do meio
ru: Средний щелчок
tr: Orta Tıklama
zh_hant: 中鍵點選

# action.shortcut
source: 快捷键
ar: الاختصار
de: Abkürzung
en: Shortcut
es: Atajo
fr: Raccourci
ja: ショートカット
ko: 바로가기
pt: Atalho
ru: Ярлык
tr: Kısayol
zh_hant: 快速方式

# action.shortcut.format
source: 快捷键 %@%d
ar: الاختصار %@%d
de: Verknüpfung %@%d
en: Shortcut %@%d
es: Acceso directo %@%d
fr: Raccourci %@%d
ja: ショートカット %@%d
ko: 바로가기 %@%d
pt: Atalho %@%d
ru: Ярлык %@%d
tr: Kısayol %@%d
zh_hant: 快鍵 %@%d

# action.spaceLeft
source: 左侧空间
ar: المساحة على اليسار
de: Platz übrig
en: Space Left
es: Espacio restante
fr: Espace restant
ja: 左スペース
ko: 남은 공간
pt: Espaço restante
ru: Пробел слева
tr: Soldaki Masaüstü
zh_hant: 剩餘空間

# action.spaceRight
source: 右侧空间
ar: المساحة على اليمين
de: Platz rechts
en: Space Right
es: Espacio derecho
fr: Espace à droite
ja: 右のスペース
ko: 스페이스 오른쪽
pt: Espaço à direita
ru: Пространство справа
tr: Sağdaki Masaüstü
zh_hant: 空間權

# action.volumeDown
source: 降低音量
ar: خفض مستوى الصوت
de: Lautstärke verringern
en: Volume Down
es: Bajar volumen
fr: Baisser le volume
ja: 音量を下げる
ko: 볼륨 낮추기
pt: Diminuir volume
ru: Уменьшить громкость
tr: Sesi Azalt
zh_hant: 調低音量

# action.volumeUp
source: 提高音量
ar: رفع مستوى الصوت
de: Lautstärke erhöhen
en: Volume Up
es: Subir volumen
fr: Augmenter le volume
ja: ボリュームアップ
ko: 볼륨 높이기
pt: Aumentar o volume
ru: Увеличение громкости
tr: Sesi Artır
zh_hant: 調高音量

# error.accessibilityRequired
source: 请先授予辅助功能权限以启用规则。
ar: منح إذن الوصول لتمكين القواعد.
de: Erteilen Sie die Berechtigung „Barrierefreiheit“, um Regeln zu aktivieren.
en: Grant Accessibility permission to enable rules.
es: Otorgue permiso de Accesibilidad para habilitar reglas.
fr: Accordez l’autorisation d’accessibilité pour activer les règles.
ja: ルールを有効にするためのアクセシビリティ権限を付与します。
ko: 규칙을 활성화하려면 접근성 권한을 부여하세요.
pt: Conceda permissão de acessibilidade para ativar regras.
ru: Предоставьте разрешение на доступность, чтобы включить правила.
tr: Kuralları etkinleştirmek için Erişilebilirlik izni verin.
zh_hant: 授予輔助功能權限以啟用規則。

# error.inputMonitoringRequired
source: 请先授予输入监控权限以启用规则。
ar: منح إذن مراقبة الإدخال لتمكين القواعد.
de: Erteilen Sie die Berechtigung „Eingabeüberwachung“, um Regeln zu aktivieren.
en: Grant Input Monitoring permission to enable rules.
es: Otorgue permiso de Monitoreo de entrada para habilitar reglas.
fr: Accordez l’autorisation de surveillance des entrées pour activer les règles.
ja: ルールを有効にするための入力監視アクセス許可を付与します。
ko: 규칙을 활성화하려면 입력 모니터링 권한을 부여하세요.
pt: Conceda permissão de monitoramento de entrada para ativar regras.
ru: Предоставьте разрешение на мониторинг ввода, чтобы включить правила.
tr: Kuralları etkinleştirmek için Giriş İzleme izni verin.
zh_hant: 授予輸入監控權限以啟用規則。

# error.tapUnavailable
source: 无法启动输入监听，请检查权限后重试。
ar: تعذر بدء مراقبة الإدخال. تحقق من الأذونات وحاول مرة أخرى.
de: Die Eingabeüberwachung konnte nicht gestartet werden. Überprüfen Sie die Berechtigungen und versuchen Sie es erneut.
en: Input monitoring could not start. Check permissions and try again.
es: No se pudo iniciar el monitoreo de entrada. Verifique los permisos y vuelva a intentarlo.
fr: La surveillance des entrées n'a pas pu démarrer. Vérifiez les autorisations et réessayez.
ja: 入力監視を開始できませんでした。権限を確認して、再試行してください。
ko: 입력 모니터링을 시작할 수 없습니다. 권한을 확인하고 다시 시도하세요.
pt: O monitoramento de entrada não pôde ser iniciado. Verifique as permissões e tente novamente.
ru: Не удалось запустить мониторинг входа. Проверьте разрешения и повторите попытку.
tr: Girdi izleme başlatılamadı. İzinleri denetleyin ve yeniden deneyin.
zh_hant: 輸入監控無法啟動。檢查權限並重試。

# metadata.description
source: 将输入映射为操作
ar: اربط الإدخالات بالإجراءات
de: Eingaben Aktionen zuordnen
en: Map inputs to actions
es: Asigna entradas a acciones
fr: Associer les entrées aux actions
ja: 入力をアクションに割り当てます
ko: 입력을 동작에 연결합니다
pt: Associe entradas a ações
ru: Сопоставляйте ввод с действиями
tr: Girdileri eylemlerle eşleştirin
zh_hant: 將輸入對應至操作

# metadata.title
source: 自定义快捷操作：键盘、触控板、鼠标
ar: اختصارات مخصصة: لوحة المفاتيح، لوحة التتبع، الماوس
de: Eigene Kurzbefehle: Tastatur, Trackpad, Maus
en: Custom Shortcuts: Keyboard, Trackpad, Mouse
es: Atajos personalizados: Teclado, Panel táctil, Ratón
fr: Raccourcis personnalisés : Clavier, Pavé tactile, Souris
ja: カスタムショートカット：キーボード、トラックパッド、マウス
ko: 사용자화 단축키: 키보드, 트랙패드, 마우스
pt: Atalhos personalizados: Teclado, Trackpad, Rato
ru: Пользовательские сочетания: Клавиатура, Трекпад, Мышь
tr: Özel Kısayollar: Klavye, Trackpad, Fare
zh_hant: 自訂快速操作：鍵盤、觸控板、滑鼠

# panel.button.settings
source: 设置
ar: الإعدادات
de: Einstellungen
en: Settings
es: Configuración
fr: Paramètres
ja: 設定
ko: 설정
pt: Configurações
ru: Настройки
tr: Ayarlar
zh_hant: 設定

# panel.subtitle.activeRulesFormat
source: %d 条活跃规则
ar: %d القواعد النشطة
de: %d aktive Regeln
en: %d active rules
es: %d reglas activas
fr: %d règles actives
ja: %d のアクティブなルール
ko: %d 활성 규칙
pt: %d regras ativas
ru: %d активные правила
tr: %d etkin kural
zh_hant: %d 活動規則

# panel.subtitle.noRules
source: 无规则
ar: لا توجد قواعد
de: Keine Regeln
en: No rules
es: Sin reglas
fr: Aucune règle
ja: ルールなし
ko: 규칙 없음
pt: Sem regras
ru: Никаких правил
tr: Kural yok
zh_hant: 沒有規則

# permission.accessibility.description
source: 用于发送重映射后的鼠标点击和快捷键。
ar: يستخدم لإرسال نقرات واختصارات الماوس المعاد تعيينها.
de: Wird zum Senden neu zugeordneter Mausklicks und Verknüpfungen verwendet.
en: Used to send remapped mouse clicks and shortcuts.
es: Se utiliza para enviar clics del mouse y atajos reasignados.
fr: Utilisé pour envoyer des clics de souris et des raccourcis remappés.
ja: 再マッピングされたマウス クリックとショートカットを送信するために使用されます。
ko: 다시 매핑된 마우스 클릭과 바로가기를 보내는 데 사용됩니다.
pt: Usado para enviar cliques e atalhos do mouse remapeados.
ru: Используется для отправки переназначенных щелчков мыши и ярлыков.
tr: Yeniden eşlenen fare tıklamalarını ve kısayolları göndermek için kullanılır.
zh_hant: 用於發送重新映射的滑鼠點擊和快捷方式。

# permission.accessibility.footnote
source: 系统设置 → 隐私与安全性 → 辅助功能，允许 MacTools。
ar: إعدادات النظام ← الخصوصية والأمان ← إمكانية الوصول: السماح بـ MacTools.
de: Systemeinstellungen → Datenschutz und Sicherheit → Barrierefreiheit: MacTools zulassen.
en: System Settings → Privacy & Security → Accessibility: allow MacTools.
es: Configuración del sistema → Privacidad y seguridad → Accesibilidad: permitir MacTools.
fr: Paramètres système → Confidentialité et sécurité → Accessibilité : autorisez MacTools.
ja: システム設定 → プライバシーとセキュリティ → アクセシビリティ: MacTools を許可します。
ko: 시스템 설정 → 개인 정보 보호 및 보안 → 접근성: MacTools를 허용합니다.
pt: Configurações do sistema → Privacidade e segurança → Acessibilidade: permitir MacTools.
ru: Системные настройки → Конфиденциальность и безопасность → Доступность: разрешить MacTools.
tr: Sistem Ayarları → Gizlilik ve Güvenlik → Erişilebilirlik: MacTools'a izin verin.
zh_hant: 系統設定 → 隱私和安全性 → 輔助功能：允許 MacTools。

# permission.accessibility.title
source: 辅助功能
ar: إمكانية الوصول
de: Barrierefreiheit
en: Accessibility
es: Accesibilidad
fr: Accessibilité
ja: アクセシビリティ
ko: 접근성
pt: Acessibilidade
ru: Доступность
tr: Erişilebilirlik
zh_hant: 無障礙

# permission.inputMonitoring.description
source: 用于在系统范围内监听键盘、鼠标和滚动输入。所有处理均在本机完成。
ar: يستخدم لمراقبة لوحة المفاتيح والماوس وإدخال التمرير على مستوى النظام. تبقى جميع عمليات المعالجة على جهاز Mac هذا.
de: Wird zur systemweiten Überwachung von Tastatur-, Maus- und Scroll-Eingaben verwendet. Die gesamte Verarbeitung bleibt auf diesem Mac.
en: Used to monitor keyboard, mouse, and scroll input system-wide. All processing stays on this Mac.
es: Se utiliza para monitorear el teclado, el mouse y la entrada de desplazamiento en todo el sistema. Todo el procesamiento permanece en esta Mac.
fr: Utilisé pour surveiller les entrées du clavier, de la souris et du défilement à l’échelle du système. Tous les traitements restent sur ce Mac.
ja: システム全体のキーボード、マウス、スクロール入力を監視するために使用されます。すべての処理はこの Mac 上に留まります。
ko: 시스템 전체에서 키보드, 마우스 및 스크롤 입력을 모니터링하는 데 사용됩니다. 모든 처리는 이 Mac에 유지됩니다.
pt: Usado para monitorar teclado, mouse e entrada de rolagem em todo o sistema. Todo o processamento permanece neste Mac.
ru: Используется для мониторинга ввода с клавиатуры, мыши и прокрутки во всей системе. Вся обработка остается на этом Mac.
tr: Klavye, fare ve kaydırma girdisini sistem genelinde izlemek için kullanılır. Tüm işlemler bu Mac'te kalır.
zh_hant: 用於監視系統範圍內的鍵盤、滑鼠和滾動輸入。所有處理都在這台 Mac 上進行。

# permission.inputMonitoring.footnote
source: 系统设置 → 隐私与安全性 → 输入监控，允许 MacTools。
ar: إعدادات النظام ← الخصوصية والأمان ← مراقبة الإدخال: اسمح لـ MacTools.
de: Systemeinstellungen → Datenschutz und Sicherheit → Eingabeüberwachung: MacTools zulassen.
en: System Settings → Privacy & Security → Input Monitoring: allow MacTools.
es: Configuración del sistema → Privacidad y seguridad → Monitoreo de entrada: permitir MacTools.
fr: Paramètres système → Confidentialité et sécurité → Surveillance des entrées : autorisez MacTools.
ja: システム設定 → プライバシーとセキュリティ → 入力監視: MacTools を許可します。
ko: 시스템 설정 → 개인 정보 보호 및 보안 → 입력 모니터링: MacTools를 허용합니다.
pt: Configurações do sistema → Privacidade e segurança → Monitoramento de entrada: permitir MacTools.
ru: Системные настройки → Конфиденциальность и безопасность → Мониторинг ввода: разрешить MacTools.
tr: Sistem Ayarları → Gizlilik ve Güvenlik → Giriş İzleme: MacTools'a izin verin.
zh_hant: 系統設定 → 隱私和安全性 → 輸入監控：允許 MacTools。

# permission.inputMonitoring.title
source: 输入监控
ar: مراقبة المدخلات
de: Eingabeüberwachung
en: Input Monitoring
es: Monitoreo de entrada
fr: Surveillance des entrées
ja: 入力モニタリング
ko: 입력 모니터링
pt: Monitoramento de entrada
ru: Входной мониторинг
tr: Giriş İzleme
zh_hant: 輸入監控

# settings.action
source: 操作
ar: العمل
de: Aktion
en: Action
es: acción
fr: Action
ja: アクション
ko: 액션
pt: Ação
ru: Действие
tr: Eylem
zh_hant: 行動

# settings.addRule
source: 添加快捷操作
ar: إضافة اختصار
de: Kurzbefehl hinzufügen
en: Add Shortcut
es: Añadir atajo
fr: Ajouter un raccourci
ja: ショートカットを追加
ko: 단축키 추가
pt: Adicionar atalho
ru: Добавить сочетание
tr: Kısayol Ekle
zh_hant: 加入快速操作

# settings.button.format
source: 按键 %d
ar: الزر %d
de: Schaltfläche %d
en: Button %d
es: Botón %d
fr: Bouton %d
ja: ボタン %d
ko: 버튼 %d
pt: Botão %d
ru: Кнопка %d
tr: Düğme %d
zh_hant: 按鈕 %d

# settings.button.record
source: 录制
ar: سجل
de: Aufnahme
en: Record
es: Registro
fr: Enregistrer
ja: 記録
ko: 기록
pt: Gravar
ru: Запись
tr: Kaydet
zh_hant: 記錄

# settings.button.record.help
source: 按下鼠标侧键或其他额外按键来选择它。
ar: اضغط على أحد أزرار الماوس الجانبية أو أي زر إضافي آخر لتحديده.
de: Drücken Sie eine seitliche oder andere zusätzliche Maustaste, um es auszuwählen.
en: Press a side or other extra mouse button to select it.
es: Presione un botón lateral u otro botón adicional del mouse para seleccionarlo.
fr: Appuyez sur un bouton latéral ou autre bouton supplémentaire de la souris pour le sélectionner.
ja: マウスの横ボタンまたはその他の追加のボタンを押して選択します。
ko: 측면 또는 기타 추가 마우스 버튼을 눌러 선택하십시오.
pt: Pressione um botão lateral ou outro botão extra do mouse para selecioná-lo.
ru: Нажмите боковую или другую дополнительную кнопку мыши, чтобы выбрать его.
tr: Seçmek için yan ya da başka bir ek fare düğmesine basın.
zh_hant: 按下側邊按鈕或其他額外的滑鼠按鈕將其選取。

# settings.button.recording
source: 按下要使用的额外鼠标按键
ar: اضغط على زر الماوس الإضافي للاستخدام
de: Drücken Sie zur Verwendung die zusätzliche Maustaste
en: Press the extra mouse button to use
es: Presione el botón adicional del mouse para usar
fr: Appuyez sur le bouton supplémentaire de la souris pour utiliser
ja: 追加のマウス ボタンを押して使用します
ko: 추가 마우스 버튼을 눌러 사용하세요.
pt: Pressione o botão extra do mouse para usar
ru: Нажмите дополнительную кнопку мыши, чтобы использовать
tr: Kullanılacak ek fare düğmesine basın
zh_hant: 按下額外的滑鼠按鈕即可使用

# settings.cancel
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# settings.delete
source: 删除
ar: حذف
de: Löschen
en: Delete
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt: Excluir
ru: Удалить
tr: Sil
zh_hant: 刪除

# settings.deleteMapping
source: 删除快捷操作
ar: حذف الاختصار
de: Kurzbefehl löschen
en: Delete shortcut
es: Eliminar atajo
fr: Supprimer le raccourci
ja: ショートカットを削除
ko: 단축키 삭제
pt: Excluir atalho
ru: Удалить сочетание
tr: Kısayolu Sil
zh_hant: 刪除快速操作

# settings.empty
source: 点击上方的“添加快捷操作”，然后录制输入并选择要执行的操作。
ar: انقر على «إضافة اختصار» أعلاه، ثم سجّل إدخالاً واختر الإجراء المطلوب.
de: Klicken Sie oben auf „Kurzbefehl hinzufügen“, zeichnen Sie eine Eingabe auf und wählen Sie die Aktion.
en: Click Add Shortcut above, then record an input and choose its action.
es: Haz clic arriba en Añadir atajo, registra una entrada y elige la acción.
fr: Cliquez sur Ajouter un raccourci ci-dessus, enregistrez une entrée, puis choisissez son action.
ja: 上の「ショートカットを追加」をクリックして、入力を記録し、実行するアクションを選択します。
ko: 위의 단축키 추가를 클릭한 다음 입력을 기록하고 실행할 동작을 선택하세요.
pt: Clique em Adicionar atalho acima, registre uma entrada e escolha a ação.
ru: Нажмите «Добавить сочетание» выше, запишите ввод и выберите действие.
tr: Yukarıdaki Kısayol Ekle düğmesine tıklayın, ardından bir girdi kaydedin ve eylemini seçin.
zh_hant: 點擊上方的「加入快速操作」，然後記錄輸入並選擇要執行的動作。

# settings.empty.title
source: 创建第一个快捷操作
ar: أنشئ اختصارك الأول
de: Erstellen Sie Ihren ersten Kurzbefehl
en: Create your first shortcut
es: Crea tu primer atajo
fr: Créez votre premier raccourci
ja: 最初のショートカットを作成
ko: 첫 번째 단축키 만들기
pt: Crie seu primeiro atalho
ru: Создайте первое сочетание
tr: İlk kısayolunuzu oluşturun
zh_hant: 建立第一個快速操作

# settings.enabled
source: 启用
ar: ممكّن
de: Aktiviert
en: Enabled
es: Habilitado
fr: Activé
ja: 有効
ko: 활성화됨
pt: Habilitado
ru: Включено
tr: Etkin
zh_hant: 啟用

# settings.rules.title
source: 自定义快捷操作：键盘、触控板、鼠标
ar: اختصارات مخصصة: لوحة المفاتيح، لوحة التتبع، الماوس
de: Eigene Kurzbefehle: Tastatur, Trackpad, Maus
en: Custom Shortcuts: Keyboard, Trackpad, Mouse
es: Atajos personalizados: Teclado, Panel táctil, Ratón
fr: Raccourcis personnalisés : Clavier, Pavé tactile, Souris
ja: カスタムショートカット：キーボード、トラックパッド、マウス
ko: 사용자화 단축키: 키보드, 트랙패드, 마우스
pt: Atalhos personalizados: Teclado, Trackpad, Rato
ru: Пользовательские сочетания: Клавиатура, Трекпад, Мышь
tr: Özel Kısayollar: Klavye, Trackpad, Fare
zh_hant: 自訂快速操作：鍵盤、觸控板、滑鼠

# settings.rules.subtitle
source: 将输入映射为操作
ar: اربط الإدخالات بالإجراءات
de: Eingaben Aktionen zuordnen
en: Map inputs to actions
es: Asigna entradas a acciones
fr: Associer les entrées aux actions
ja: 入力をアクションに割り当てます
ko: 입력을 동작에 연결합니다
pt: Associe entradas a ações
ru: Сопоставляйте ввод с действиями
tr: Girdileri eylemlerle eşleştirin
zh_hant: 將輸入對應至操作

# settings.shortcutKeyCode.format
source: 快捷键代码 %d
ar: رمز مفتاح الاختصار %d
de: Tastenkombinationscode %d
en: Shortcut key code %d
es: Código de tecla de acceso directo %d
fr: Code de touche de raccourci %d
ja: ショートカットキーコード%d
ko: 바로가기 키 코드 %d
pt: Código da tecla de atalho %d
ru: Код горячей клавиши %d
tr: Kısayol tuş kodu %d
zh_hant: 快速鍵代碼 %d

# settings.input.record
source: 录制输入
ar: سجل الإدخال
de: Eingabe aufzeichnen
en: Record input
es: Entrada de registro
fr: Enregistrer la saisie
ja: レコード入力
ko: 입력 캡처
pt: Entrada de registro
ru: Запись ввода
tr: Girdiyi Kaydet
zh_hant: 記錄輸入

# settings.input.recording
source: 按任意按键、鼠标按钮或滚动
ar: اضغط على أي مفتاح أو زر ماوس أو قم بالتمرير
de: Drücken Sie eine beliebige Taste, Maustaste oder scrollen Sie
en: Press any key, mouse button, or scroll
es: Presione cualquier tecla, botón del mouse o desplácese
fr: Appuyez sur n'importe quelle touche, bouton de la souris ou faites défiler
ja: 任意のキー、マウス ボタン、またはスクロールを押す
ko: 아무 키나 마우스 버튼을 누르거나 스크롤하십시오.
pt: Pressione qualquer tecla, botão do mouse ou role
ru: Нажмите любую клавишу, кнопку мыши или прокрутите
tr: Herhangi bir tuşa veya fare düğmesine basın ya da kaydırın
zh_hant: 按任何鍵、滑鼠按鈕或捲動

# settings.input.record.help
source: 下一次键盘、鼠标或滚动输入将成为触发条件。
ar: يصبح مفتاح لوحة المفاتيح أو زر الماوس أو اتجاه التمرير التالي هو هذا المشغل.
de: Die nächste Tastaturtaste, Maustaste oder Bildlaufrichtung wird zu diesem Auslöser.
en: The next keyboard key, mouse button, or scroll direction becomes this trigger.
es: La siguiente tecla del teclado, botón del mouse o dirección de desplazamiento se convierte en este activador.
fr: La prochaine touche du clavier, le bouton de la souris ou la direction de défilement suivante devient ce déclencheur.
ja: 次のキーボード キー、マウス ボタン、またはスクロール方向がこのトリガーになります。
ko: 다음 키보드 키, 마우스 버튼 또는 스크롤 방향이 이 트리거가 됩니다.
pt: A próxima tecla do teclado, botão do mouse ou direção de rolagem se torna esse acionador.
ru: Этим триггером становится следующая клавиша клавиатуры, кнопка мыши или направление прокрутки.
tr: Sıradaki klavye tuşu, fare düğmesi veya kaydırma yönü bu tetikleyici olur.
zh_hant: 下一個鍵盤鍵、滑鼠按鈕或滾動方向將成為此觸發器。

# settings.mouseInteraction
source: 鼠标操作
ar: تفاعل الماوس
de: Mausinteraktion
en: Mouse interaction
es: Interacción del ratón
fr: Interaction avec la souris
ja: マウスのインタラクション
ko: 마우스 상호작용
pt: Interação do mouse
ru: Взаимодействие с мышью
tr: Fare etkileşimi
zh_hant: 滑鼠交互

# settings.mouseInteraction.warning
source: 双击和长按会保留原始点击，以避免延迟或重放输入。
ar: انقر نقرًا مزدوجًا واضغط لفترة طويلة للحفاظ على النقرة الأصلية متاحة لتجنب تأخير الإدخال أو إعادة تشغيله.
de: Durch Doppelklicken und langes Drücken bleibt der ursprüngliche Klick verfügbar, um eine Verzögerung oder Wiederholung der Eingabe zu vermeiden.
en: Double-click and long-press keep the original click available to avoid delaying or replaying input.
es: Haga doble clic y mantenga presionado para mantener disponible el clic original para evitar retrasar o reproducir la entrada.
fr: Double-cliquez et appuyez longuement pour conserver le clic d'origine disponible pour éviter de retarder ou de relire la saisie.
ja: ダブルクリックして長押しすると、入力の遅れや再入力を避けるために、元のクリックが利用可能な状態に保たれます。
ko: 두 번 클릭하고 길게 누르면 입력이 지연되거나 재생되는 것을 방지하기 위해 원래 클릭을 계속 사용할 수 있습니다.
pt: Clique duas vezes e mantenha pressionado para manter o clique original disponível para evitar atraso ou repetição da entrada.
ru: Двойной щелчок и долгое нажатие сохраняют исходный щелчок доступным, чтобы избежать задержки или повторного воспроизведения ввода.
tr: Girdinin gecikmesini veya yeniden yürütülmesini önlemek için çift tıklama ve uzun basma, özgün tıklamayı korur.
zh_hant: 雙擊和長按可保持原始點擊可用，以避免延遲或重播輸入。

# settings.keyboard.warning
source: 启用后，无修饰键会覆盖正常输入。
ar: يؤدي المفتاح الذي لا يحتوي على معدلات إلى تجاوز الكتابة العادية أثناء تمكين القاعدة.
de: Eine Taste ohne Modifikatoren überschreibt die normale Eingabe, während die Regel aktiviert ist.
en: A key without modifiers overrides normal typing while the rule is enabled.
es: Una clave sin modificadores anula la escritura normal mientras la regla está habilitada.
fr: Une touche sans modificateurs remplace la saisie normale lorsque la règle est activée.
ja: ルールが有効な場合、修飾子のないキーは通常の入力をオーバーライドします。
ko: 수정자가 없는 키는 규칙이 활성화된 동안 일반 입력을 재정의합니다.
pt: Uma tecla sem modificadores substitui a digitação normal enquanto a regra está habilitada.
ru: Ключ без модификаторов переопределяет обычный ввод, пока правило включено.
tr: Değiştirici tuşu olmayan bir tuş, kural etkinken normal yazmayı geçersiz kılar.
zh_hant: 啟用規則時，不帶修飾符的鍵會覆蓋正常鍵入。

# settings.keyboard.confirmation.title
source: 启用此触发器？
ar: هل تريد تمكين هذا المُشغِّل؟
de: Diesen Auslöser aktivieren?
en: Enable this trigger?
es: ¿Activar este activador?
fr: Activer ce déclencheur ?
ja: このトリガーを有効にしますか？
ko: 이 트리거를 활성화할까요?
pt: Ativar este acionador?
ru: Включить этот триггер?
tr: Bu tetikleyici etkinleştirilsin mi?
zh_hant: 啟用此觸發條件？

# settings.keyboard.confirmation.message
source: 此规则会在全系统范围内拦截输入。随时按下 ⌃⌥⌘Esc 即可停用不安全的快捷键。
ar: تعترض هذه القاعدة الإدخال على مستوى النظام. اضغط ⌃⌥⌘Esc في أي وقت لتعطيل الاختصارات غير الآمنة.
de: Diese Regel fängt Eingaben systemweit ab. Drücken Sie jederzeit ⌃⌥⌘Esc, um unsichere Kurzbefehle zu deaktivieren.
en: This rule intercepts input system-wide. Press ⌃⌥⌘Esc at any time to disable unsafe shortcuts.
es: Esta regla intercepta entradas en todo el sistema. Pulsa ⌃⌥⌘Esc en cualquier momento para desactivar los atajos no seguros.
fr: Cette règle intercepte les entrées à l’échelle du système. Appuyez à tout moment sur ⌃⌥⌘Échap pour désactiver les raccourcis à risque.
ja: このルールはシステム全体の入力をインターセプトします。⌃⌥⌘Esc を押すと、危険なショートカットをいつでも無効にできます。
ko: 이 규칙은 시스템 전체의 입력을 가로챕니다. 언제든지 ⌃⌥⌘Esc를 눌러 안전하지 않은 단축키를 비활성화할 수 있습니다.
pt: Esta regra intercepta entradas em todo o sistema. Pressione ⌃⌥⌘Esc a qualquer momento para desativar atalhos não seguros.
ru: Это правило перехватывает ввод во всей системе. Нажмите ⌃⌥⌘Esc в любое время, чтобы отключить небезопасные сочетания клавиш.
tr: Bu kural girdiyi sistem genelinde yakalar. Güvenli olmayan kısayolları devre dışı bırakmak için istediğiniz zaman ⌃⌥⌘Esc tuşlarına basabilirsiniz.
zh_hant: 此規則會攔截系統範圍內的輸入。隨時按下 ⌃⌥⌘Esc 即可停用不安全的快速鍵。
